# Get latest everything:
# 	brew update && brew bundle
#
# updates homebrew itself:
# 	brew update
# upgrade all individual packages:
# 	brew upgrade <package>
#
# brew bundle install
# brew bundle check --debug
# brew bundle cleanup --force

# set arguments for all "brew install --cask" commands
cask_args appdir: "/Applications", no_quarantine: true

# ---------------------------------------------------------------------------------------------------
tap "buo/cask-upgrade"
# ------------------------------------------------------------------------------
brew "zsh"
brew "zsh-autosuggestions"
brew "powerlevel10k"
# brew "fortune"
cask "alacritty"
# cask "spotify"
# cask "asana"
brew "terminal-notifier" # for bgnotify on OSX
brew "fswatch"
# ------------------------------------------------------------------------------
# tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-hack-nerd-font"
# ------------------------------------------------------------------------------
brew "coreutils"
brew "stow"
brew "cmake"
brew "zip"
brew "tree"
brew "gcc"
brew "llvm"
# brew "bash"
# brew "gsed"
# brew "watch"
# brew "zlib"
brew "fd"
brew "fzf"
brew "bat"
brew "bat-extras"
brew "ripgrep"
brew "bob" # neovim version manager
# brew "netcat"
# brew "telnet"
# brew "doggo"
# brew "nmap"
# brew "ansifilter"
# brew "ncdu"
brew "certbot"
# ------------------------------------------------------------------------------
# brew "lazygit"
brew "gh"
# brew "act" # github actions local runner
brew "pre-commit"
brew "git-secrets"
brew "git-lfs"
brew "git-delta"
# ------------------------------------------------------------------------------
cask "cursor"
brew "llm"
cask "copilot-cli"
# brew "w3m"
brew "httpie"
# cask "httpie"  # httpie desktop
brew "jq"
tap "noahgorstein/tap"
brew "noahgorstein/tap/jqp"
brew "yq"
# brew "speedtest-cli"
# brew "ffmpeg"
# tap "lucapette/tap"
# brew "lucapette/tap/fakedata"
cask "postman"
brew "openapi-generator"
cask "devtoys"
cask "docker-desktop"
# brew "diffoci"
# brew "jmeter"
# cask "chatgpt"
# cask "claude"
# brew "yt-dlp"
# ------------------------------------------------------------------------------
# ------------------------------------------------------------------------------
# brew "pgformatter"
# brew "postgresql@14"
# brew "libpq"
#brew "pyenv" # python version manager
# brew "uv"
# brew "poetry"
# brew "ruff"
# brew "cookiecutter"
# brew "rustup"
# brew "node@20"
brew "nvm" # node version manager
brew "prettier"
brew "yarn"
brew "typescript"
brew "golang"
# ------------------------------------------------------------------------------
# brew "awscli", link: true
# brew "awslogs"
# brew "aws-sso-cli"
# brew "aws-nuke"
# cask "session-manager-plugin"
# tap "lucagrulla/tap"
# brew "lucagrulla/tap/cw" # CloudWatch logs
# brew "cfn-lint"
# ------------------------------------------------------------------------------
# brew "stylua"
# brew "yamllint"
# brew "codespell"
# brew "shellcheck"
# ------------------------------------------------------------------------------
# brew "task"
# brew "timewarrior"
# ------------------------------------------------------------------------------
# brew "scrcpy"
# cask "android-platform-tools"
# ------------------------------------------------------------------------------
cask "obsidian"
cask "keepingyouawake"

# brew remove --force $(brew list --formula)
# brew remove --cask --force $(brew list)
# brew bundle --file ./dots/brew/.Brewfile-work
# cask "8x8-work"
brew "azure-cli"
# cask "azure-data-studio"
# cask "beyond-compare"
# softwareupdate --install-rosetta --agree-to-license
# cask "charles"
brew "composer"
cask "dbeaver-community"
cask "dotnet-sdk"
# cask "firefox"
cask "google-chrome"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-word"
brew "nvm"
cask "oracle-jdk@17"
# cask "phpstorm"
brew "php@8.2"
# cask "sourcetree"
cask "visual-studio-code"
cask "windows-app"
# ------------------------------------------------------------------------------
# Do I still need these?
# ------------------------------------------------------------------------------
# brew "openjdk"
# brew "cvs"
# brew "subversion"
# brew "gitlab-runner"
# brew "gitlab-ci-local"
# brew "glab"
# cask "soapui"
# brew "plantuml"
# brew "graphviz"
# brew "boxes"
# cask "drawio"
# brew "d2"
brew "structurizr"
# cask "xmind"
vscode "jebbs.plantuml"
vscode "streetsidesoftware.code-spell-checker"
vscode "naumovs.color-highlight"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "pkief.material-icon-theme"
