# brew bundle --file ./dots/brew/.Brewfile-work
cask "8x8-work"
brew "azure-cli"
cask "azure-data-studio"
cask "beyond-compare"
cask "charles"
brew "composer"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
# cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
brew "nvm"
cask "onedrive"
cask "oracle-jdk@17"
cask "phpstorm"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "windows-app"
