# brew bundle --file ./dots/brew/.Brewfile-work
cask "8x8-work"
brew "azure-cli"
cask "azure-data-studio"
cask "beyond-compare"
# softwareupdate --install-rosetta --agree-to-license
cask "charles"
brew "composer"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
# cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
brew "nvm"
cask "onedrive"
cask "oracle-jdk@17"
cask "phpstorm"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "windows-app"
# ------------------------------------------------------------------------------
# Do I still need these?
# ------------------------------------------------------------------------------
# brew "openjdk"
# brew "cvs"
# brew "subversion"
# brew "gitlab-runner"
# brew "gitlab-ci-local"
# brew "glab"
# cask "soapui"
brew "plantuml"
brew "graphviz"
# brew "boxes"
cask "drawio"
# cask "xmind"
vscode "ms-vscode.azure-account"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.csdevkit"
vscode "streetsidesoftware.code-spell-checker"
vscode "naumovs.color-highlight"
vscode "ms-azuretools.vscode-docker"
vscode "dbaeumer.vscode-eslint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ritwickdey.LiveServer"
vscode "DavidAnson.vscode-markdownlint"
vscode "herrmannplatz.npm-dependency-links"
vscode "42crunch.vscode-openapi"
vscode "wayou.vscode-todo-highlight"
vscode "esbenp.prettier-vscode"
vscode "Prisma.prisma"
vscode "mrmlnc.vscode-pugbeautify"
vscode "mechatroner.rainbow-csv"
vscode "richie5um2.vscode-sort-json"
vscode "redhat.vscode-xml"
vscode "adpyke.vscode-sql-formatter"
vscode "redhat.vscode-yaml"
vscode "oracle.suitecloud-vscode-extension"
