# brew bundle install
brew "stow"
brew "cmake"
brew "codespell"
brew "zip"
brew "tree"
brew "gcc"
brew "llvm"
brew "gsed"
brew "zlib"
brew "git-delta"
brew "bat"
brew "bat-extras"
brew "git-lfs"
brew "subversion"
brew "ripgrep"
brew "pgformatter"
brew "postgresql@14"
# brew "asyncapi" #< prefer `npm install -g @asyncapi/cli`
# brew "python@3.10"
# brew "python@3.9"
brew "pyenv"
brew "poetry"
brew "rustup"
brew "awscli"
# brew install --cask session-manager-plugin
# brewk install --cask powershell
brew "cfn-lint"
brew "yamllint"
brew "httpie"
brew "jq"
brew "yq"
brew "node@18"
brew "yarn"
brew "typescript"
brew "gitlab-runner"
brew "libpq", link: true
brew "graphviz"
brew "boxes"
brew "pre-commit"
brew "ffmpeg"
# brew install --cask iterm2
# brew tap homebrew/cask-fonts
# brew install --cask font-hack-nerd-font
brew "macvim"
brew "ical-buddy"
brew "neovim-qt"
brew "neovim"
brew "netcat"
brew "telnet"
brew "nmap"
brew "glab"
brew "task"
brew "timewarrior"
