# updates homebrew itself:
# 	brew update
# upgrade all individual packages:
# 	brew upgrade <package>
#
# brew bundle install
# brew bundle check --debug
# brew bundle cleanup --force
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

brew "coreutils"
brew "stow"
brew "cmake"
brew "zip"
brew "tree"
brew "gcc"
brew "llvm" # specify version of llvm for M1 MacOS
# export CC=/opt/homebrew/Cellar/llvm/15.0.6/bin/clang
brew "gsed"
brew "zlib"
brew "git-lfs"
brew "git-delta"
brew "bat"
brew "bat-extras"
brew "subversion"
brew "cvs"
brew "ripgrep"
brew "speedtest-cli"

brew "openjdk" # MUST LINK
# sudo ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
brew "plantuml"
brew "graphviz"
brew "boxes"

brew "pgformatter"
brew "postgresql@14"
brew "libpq"
brew "pyenv"
# brew "poetry" # do not install outside pyenv
brew "cookiecutter"
brew "rustup"
brew "awscli"
brew "awslogs"
cask "session-manager-plugin"
tap "lucagrulla/tap"
brew "cw" # CloudWatch logs
brew "cfn-lint"
brew "yamllint"
brew "codespell"
brew "shellcheck"
brew "httpie"
brew "jq"
brew "yq"
brew "nvm" #nvm install v20
# brew "node@20"
brew "yarn"
brew "typescript"
brew "gitlab-runner"
brew "gitlab-ci-local"
brew "pre-commit"
brew "ffmpeg"
brew "ical-buddy"
brew "neovim"
brew "fd"
# brew "neovide"
brew "netcat"
brew "telnet"
brew "nmap"
brew "glab"
brew "gh"
brew "task"
brew "timewarrior"
brew "gcal"
# brew "asyncapi" #< prefer `npm install -g @asyncapi/cli`
# brew "python@3.10"
# brew "python@3.9"
# brewk install --cask powershell
brew "golang"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
brew "scrcpy"
cask "android-platform-tools"
cask "postman"
cask "soapui"
cask "iterm2"
cask "devtoys"
cask "drawio"
cask "obsidian"
cask "vscodium"
cask "chromium", args: { no_quarantine: true }
cask "xmind"
